{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["L0_INPUT", 0, 0]], "name": "model_1", "output_layers": [["L5_DENSE3", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "L0_INPUT", "dtype": "float32"}, "name": "L0_INPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"function_type": "lambda", "name": "L1_LAMBDA", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-a3695191b029>\u00da\b<lambda>\f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "output_shape": null, "trainable": true}, "name": "L1_LAMBDA", "inbound_nodes": [[["L0_INPUT", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "L1_CONV1X1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L1_CONV1X1", "inbound_nodes": [[["L1_LAMBDA", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 4, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "L1_CONV3X3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L1_CONV3X3", "inbound_nodes": [[["L1_CONV1X1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 3, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "L1_CONV5X5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L1_CONV5X5", "inbound_nodes": [[["L1_CONV1X1", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "name": "L1_CONCAT", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw", "arguments": {}}, "name": "L1_CONCAT", "inbound_nodes": [[["L1_CONV1X1", 0, 0, {"mask": [null, null, null]}], ["L1_CONV3X3", 0, 0, {"mask": [null, null, null]}], ["L1_CONV5X5", 0, 0, {"mask": [null, null, null]}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "L1_RELU"}, "name": "L1_RELU", "inbound_nodes": [[["L1_CONCAT", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "L1_MAXPOOL", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "name": "L1_MAXPOOL", "inbound_nodes": [[["L1_RELU", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "L1_DROPOUT", "rate": 0.5}, "name": "L1_DROPOUT", "inbound_nodes": [[["L1_MAXPOOL", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 2, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "L2_CONV1X1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L2_CONV1X1", "inbound_nodes": [[["L1_DROPOUT", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 8, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "L2_CONV3X3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L2_CONV3X3", "inbound_nodes": [[["L2_CONV1X1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 6, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "L2_CONV5X5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L2_CONV5X5", "inbound_nodes": [[["L2_CONV1X1", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "name": "L2_CONCAT", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw", "arguments": {}}, "name": "L2_CONCAT", "inbound_nodes": [[["L2_CONV1X1", 0, 0, {"mask": [null, null, null]}], ["L2_CONV3X3", 0, 0, {"mask": [null, null, null]}], ["L2_CONV5X5", 0, 0, {"mask": [null, null, null]}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "L2_RELU"}, "name": "L2_RELU", "inbound_nodes": [[["L2_CONCAT", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "L2_MAXPOOL", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "name": "L2_MAXPOOL", "inbound_nodes": [[["L2_RELU", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "L2_DROPOUT", "rate": 0.5}, "name": "L2_DROPOUT", "inbound_nodes": [[["L2_MAXPOOL", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 4, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "L3_CONV1X1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L3_CONV1X1", "inbound_nodes": [[["L2_DROPOUT", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 16, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "L3_CONV3X3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L3_CONV3X3", "inbound_nodes": [[["L3_CONV1X1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 12, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "L3_CONV5X5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L3_CONV5X5", "inbound_nodes": [[["L3_CONV1X1", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "name": "L3_CONCAT", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw", "arguments": {}}, "name": "L3_CONCAT", "inbound_nodes": [[["L3_CONV1X1", 0, 0, {"mask": [null, null, null]}], ["L3_CONV3X3", 0, 0, {"mask": [null, null, null]}], ["L3_CONV5X5", 0, 0, {"mask": [null, null, null]}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "L3_RELU"}, "name": "L3_RELU", "inbound_nodes": [[["L3_CONCAT", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "L3_MAXPOOL", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "name": "L3_MAXPOOL", "inbound_nodes": [[["L3_RELU", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "L3_DROPOUT", "rate": 0.5}, "name": "L3_DROPOUT", "inbound_nodes": [[["L3_MAXPOOL", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 8, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "L4_CONV1X1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L4_CONV1X1", "inbound_nodes": [[["L3_DROPOUT", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "L4_CONV3X3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L4_CONV3X3", "inbound_nodes": [[["L4_CONV1X1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 24, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "L4_CONV5X5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L4_CONV5X5", "inbound_nodes": [[["L4_CONV1X1", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "name": "L4_CONCAT", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw", "arguments": {}}, "name": "L4_CONCAT", "inbound_nodes": [[["L4_CONV1X1", 0, 0, {"mask": [null, null, null]}], ["L4_CONV3X3", 0, 0, {"mask": [null, null, null]}], ["L4_CONV5X5", 0, 0, {"mask": [null, null, null]}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "L4_RELU"}, "name": "L4_RELU", "inbound_nodes": [[["L4_CONCAT", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "L4_MAXPOOL", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "name": "L4_MAXPOOL", "inbound_nodes": [[["L4_RELU", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "L4_DROPOUT", "rate": 0.5}, "name": "L4_DROPOUT", "inbound_nodes": [[["L4_MAXPOOL", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "trainable": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 16, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "L5_CONV1X1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null}, "name": "L5_CONV1X1", "inbound_nodes": [[["L4_DROPOUT", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "L5_FLATTEN"}, "name": "L5_FLATTEN", "inbound_nodes": [[["L5_CONV1X1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "L5_DENSE1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "units": 64}, "name": "L5_DENSE1", "inbound_nodes": [[["L5_FLATTEN", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "L5_DENSE2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "units": 32}, "name": "L5_DENSE2", "inbound_nodes": [[["L5_DENSE1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "tanh", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "L5_DENSE3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "units": 1}, "name": "L5_DENSE3", "inbound_nodes": [[["L5_DENSE2", 0, 0, {}]]]}]}, "keras_version": "2.0.8"}